set NAMES UTF8;
DROP DATABASE IF EXISTS  book;
CREATE DATABASE book CHARSET=UTF8;
USE book;

CREATE TABLE book_women(
    wid INT  PRIMARY  KEY  AUTO_INCREMENT,
    btitle VARCHAR(32) UNIQUE ,
    bpic_s VARCHAR(50),
    bpic_b VARCHAR(50),
    wordcount int,
    introduce VARCHAR (100),
    click int,
    author VARCHAR(16),
    down_url VARCHAR(55)
);

CREATE TABLE book_man(
    mid INT  PRIMARY  KEY  AUTO_INCREMENT,
    btitle VARCHAR(32) UNIQUE ,
    bpic_s VARCHAR(50),
    bpic_b VARCHAR(50),
    wordcount int,
    introduce VARCHAR (300),
    click int,
    author VARCHAR(16),
    down_url VARCHAR(55)
);

CREATE TABLE top_10(
    mid INT  PRIMARY  KEY  AUTO_INCREMENT,
    btitle VARCHAR(32) UNIQUE ,
    bpic_s VARCHAR(50),
    bpic_b VARCHAR(50),
    wordcount int,
    introduce VARCHAR (300),
    click int,
    author VARCHAR(16),
    down_url VARCHAR(55)
);







CREATE TABLE  book_user(
    user_id INT  PRIMARY KEY  AUTO_INCREMENT,
    user VARCHAR(16) UNIQUE,
    pwd VARCHAR(16)
);


INSERT  INTO  book_women VALUES
(null,'娇妻还小总裁要趁早',     '../../static/img/women/women_s_01.jpg',  '../../static/img/women/women_b_01.jpg',      '653',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '28290',      '二聂 ',''),
(null,'天价婚宠',              '../../static/img/women/women_s_02.jpg',  '../../static/img/women/women_b_02.jpg',      '453',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '18399',      '二聂 ',''),
(null,'腹黑老公小萌妻',         '../../static/img/women/women_s_03.jpg',  '../../static/img/women/women_b_03.jpg',      '193',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '12880',      '二聂 ',''),
(null,'闪婚神秘老公',           '../../static/img/women/women_s_04.jpg',  '../../static/img/women/women_b_04.jpg',      '243',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '8991',      '二聂 ',''),
(null,'大佬宠妻不腻',           '../../static/img/women/women_s_05.jpg',  '../../static/img/women/women_b_05.jpg',      '1053',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   '7890',      '二聂 ',''),
(null,'轻易靠近',              '../../static/img/women/women_s_06.jpg',   '../../static/img/women/women_b_06.jpg',      '677',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '6212',      '二聂 ',''),
(null,'异能狂妻',              '../../static/img/women/women_s_07.jpg',   '../../static/img/women/women_b_07.jpg',      '694',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '5664',      '二聂 ',''),
(null,'闪婚老公宠爆了',         '../../static/img/women/women_s_08.jpg',   '../../static/img/women/women_b_08.jpg',      '377',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   '4858',      '二聂 ',''),
(null,'赠你一生情深',           '../../static/img/women/women_s_09.jpg',   '../../static/img/women/women_b_09.jpg',      '263',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '3191',      '二聂 ',''),
(null,'娇妻高高在上',           '../../static/img/women/women_s_10.jpg',   '../../static/img/women/women_b_10.jpg',      '1653',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   '2290',      '二聂 ','');


INSERT  INTO  book_man VALUES
(null,'万古第一婿',            '../../static/img/man/man_s_01.jpg',  '../../static/img/man/man_b_01.jpg',      '653',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  '17890',      '纯情犀利哥  ',''),
(null,'一世兵王',              '../../static/img/man/man_s_02.jpg',  '../../static/img/man/man_b_02.jpg',      '453',   '是国之利刃，也是令各国地下势力闻风丧胆的华夏龙王！他有一个名动京城的未婚妻，一个个人间尤物，却相继出现在他的身边，诱惑不断，他是来者不拒，还是弱水三千，只取一瓢？他离开军营，归隐花都，怎奈树欲静而风不止，各方势力来势汹汹，草莽权贵虎视眈眈，他该如何应对？',  '13332',      '我本疯狂 ',''),
(null,'校花的贴身高手',         '../../static/img/man/man_s_03.jpg',  '../../static/img/man/man_b_03.jpg',      '193',   '一代兵王回归都市，只想好好保护战友的萝莉妹妹，却不料这条保护上竟美女如云，各色各样的极品妹子，纷沓而来……',  '9532',      '灰灰依恋 ',''),
(null,'神魂至尊',           '../../static/imgman//man_s_04.jpg',  '../../static/img/man/man_b_04.jpg',      '243',   '天铠大陆，强者为尊，在这里弱者渺小若蝼蚁，强者浩大如山岳；甚至一些至强者可以劈江断海，开山裂石；更有大神通者可破碎虚空，斩破轮回！医科大学生卓文偶得玉鼎穿越到一落魄少爷身上，靠着玉鼎中无尽的丹方以平庸的资质一步步踏上无上巅峰，成为了即使是天才也要仰望的存在！',  '8936',      '八异 ',''),
(null,'近身狂兵',           '../../static/img/man/man_s_05.jpg',  '../../static/img/man/man_b_05.jpg',      '1053',  '八年前，他被炎黄组织选中，历经地狱般的残酷训练，成为一把最强锋刃！八年后，他带着一身重伤归来，从此变成废人！经脉被毁，爱人被杀，让他在绝境中化身嗜血修罗，待他风云化龙的那一天，定让整个世界为之颤抖！',   '7983',      '月下吟 ',''),
(null,'女神的超级女婿',              '../../static/img/man/man_s_06.jpg',   '../../static/img/man/man_b_06.jpg',      '677',   '我遵循母亲的遗言，去给别人做上门女婿，去装一个废物，为期三年。现在，三年时间结束了...',  '7212',      '黑夜的瞳  ',''),
(null,'都市古医仙',              '../../static/img/man/man_s_07.jpg',   '../../static/img/man/man_b_07.jpg',      '694',   '大三学生叶不凡，碰瓷给母亲筹集医药费，却遇到不按套路出牌的女司机，被撞后获得古医门传承，从此通医术、修功法、玩转都市，赢得无数美女青睐。',  '5664',      '超爽黑啤 ',''),
(null,'都市之战神归来',         '../../static/img/man/man_s_08.jpg',   '../../static/img/man/man_b_08.jpg',      '377',  '为完成师父遗愿，特种神医唐朝回归都市成为女首富的未婚夫，开启无敌之路……别惹我，你惹不起！不管你富可敌国还是权倾天下，你的命，由我掌控！在这花花都市之中，纵意花海，一针生，一针死。不服者，吊打……',   '4093',      '路过地狱 ',''),
(null,'修罗天帝',           '../../static/img/man/man_s_09.jpg',   '../../static/img/man/man_b_09.jpg',      '263',   '八年前，雷霆古城一夜惊变，少城主秦命押入青云宗为仆，二十万民众赶进大青山为奴。八年后，淬灵入武，修罗觉醒，不屈少年逆天崛起。给我一柄刀，可破苍穹，给我一柄剑，可指霄汉。金麟岂是池中物，一遇风云便化龙。当修罗子、不死王、雷霆战尊、古海蛮皇等等一个个封号落在秦命身上，',  '3329',      '实验小白鼠  ',''),
(null,'九阳神王',           '../../static/img/man/man_s_10.jpg',   '../../static/img/man/man_b_10.jpg',      '1653',  '落魄皇子秦云，得九阳传承，觉醒惊世武魂，习得绝世炼器之术。从此，他在修武大道上，一路潇洒风流。各种武道强者，为求他炼器，甘愿充当他当小弟。各色神女圣女，为求他炼器，都愿意委身与他。但秦云却不满意，天下美女十斗，他就要占十斗。',   '3323',      '寂小贼  ','');


INSERT  INTO  top_10 VALUES
(null,'娇妻还小总裁要趁早',     '../../static/img/women/women_s_01.jpg',  '../../static/img/women/women_b_01.jpg',      '653',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  28290,      '二聂 ',''),
(null,'天价婚宠',              '../../static/img/women/women_s_02.jpg',  '../../static/img/women/women_b_02.jpg',      '453',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  18399,      '二聂 ',''),
(null,'腹黑老公小萌妻',         '../../static/img/women/women_s_03.jpg',  '../../static/img/women/women_b_03.jpg',      '193',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  12880,      '二聂 ',''),
(null,'闪婚神秘老公',           '../../static/img/women/women_s_04.jpg',  '../../static/img/women/women_b_04.jpg',      '243',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  8991,      '二聂 ',''),
(null,'大佬宠妻不腻',           '../../static/img/women/women_s_05.jpg',  '../../static/img/women/women_b_05.jpg',      '1053',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   7890,      '二聂 ',''),
(null,'轻易靠近',              '../../static/img/women/women_s_06.jpg',   '../../static/img/women/women_b_06.jpg',      '677',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  6212,      '二聂 ',''),
(null,'异能狂妻',              '../../static/img/women/women_s_07.jpg',   '../../static/img/women/women_b_07.jpg',      '694',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  5664,      '二聂 ',''),
(null,'闪婚老公宠爆了',         '../../static/img/women/women_s_08.jpg',   '../../static/img/women/women_b_08.jpg',      '377',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   4858,      '二聂 ',''),
(null,'赠你一生情深',           '../../static/img/women/women_s_09.jpg',   '../../static/img/women/women_b_09.jpg',      '263',   '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',  3191,      '二聂 ',''),
(null,'娇妻高高在上',           '../../static/img/women/women_s_10.jpg',   '../../static/img/women/women_b_10.jpg',      '1653',  '再见面，她是公司小职员，刚刚离了婚的弃妇。甚至因为自尊心的问题，傲然地净身出户。而他则是高高在上的公司老板，万千女性的梦中情人。高大英俊、聪明睿智，不知道迷倒了多少名门千金。可是两个本不该有任何交集的人，却因为一次次机缘巧合碰撞在一起。但是，一切真的只是巧合吗？',   2290,      '二聂 ',''),
(null,'万古第一婿',            '../../static/img/man/man_b_01.jpg',  '../../static/img/man/man_b_01.jpg',      '653',   '许无舟穿越了，惊愕的他发现自己成了上门女婿，不只是公认的废物蛀虫，还在新婚之夜躺在了新娘闺蜜的床上。吃顿饭却误入青楼，清冷的妻子对他失望透顶，老丈人打发他去家族武堂，任他任生任灭。可他却因为穿越，得到了一只破破烂烂需要依靠吞万物才能修复的轮回碗，而每修复一道裂缝就会反馈他力量。吞一块铁，获得一牛之力；吞一块银，境界提升一重；吞一块金，战技修至大成。……于是，许无舟开启了他放荡不羁的人生。',  17890,      '纯情犀利哥  ',''),
(null,'一世兵王',              '../../static/img/man/man_b_02.jpg',  '../../static/img/man/man_b_02.jpg',      '453',   '是国之利刃，也是令各国地下势力闻风丧胆的华夏龙王！他有一个名动京城的未婚妻，一个个人间尤物，却相继出现在他的身边，诱惑不断，他是来者不拒，还是弱水三千，只取一瓢？他离开军营，归隐花都，怎奈树欲静而风不止，各方势力来势汹汹，草莽权贵虎视眈眈，他该如何应对？',  13332,      '我本疯狂 ',''),
(null,'校花的贴身高手',         '../../static/img/man/man_b_03.jpg',  '../../static/img/man/man_b_03.jpg',      '193',   '一代兵王回归都市，只想好好保护战友的萝莉妹妹，却不料这条保护上竟美女如云，各色各样的极品妹子，纷沓而来……',  9532,      '灰灰依恋 ',''),
(null,'神魂至尊',               '../../static/img/man/man_b_04.jpg',  '../../static/img/man/man_b_04.jpg',      '243',   '天铠大陆，强者为尊，在这里弱者渺小若蝼蚁，强者浩大如山岳；甚至一些至强者可以劈江断海，开山裂石；更有大神通者可破碎虚空，斩破轮回！医科大学生卓文偶得玉鼎穿越到一落魄少爷身上，靠着玉鼎中无尽的丹方以平庸的资质一步步踏上无上巅峰，成为了即使是天才也要仰望的存在！',  8936,      '八异 ',''),
(null,'近身狂兵',               '../../static/img/man/man_b_05.jpg',  '../../static/img/man/man_b_05.jpg',      '1053',  '八年前，他被炎黄组织选中，历经地狱般的残酷训练，成为一把最强锋刃！八年后，他带着一身重伤归来，从此变成废人！经脉被毁，爱人被杀，让他在绝境中化身嗜血修罗，待他风云化龙的那一天，定让整个世界为之颤抖！',   7983,      '月下吟 ',''),
(null,'女神的超级女婿',          '../../static/img/man/man_b_06.jpg',   '../../static/img/man/man_b_06.jpg',      '677',   '我遵循母亲的遗言，去给别人做上门女婿，去装一个废物，为期三年。现在，三年时间结束了...',  7212,      '黑夜的瞳  ',''),
(null,'都市古医仙',              '../../static/img/man/man_b_07.jpg',   '../../static/img/man/man_b_07.jpg',      '694',   '大三学生叶不凡，碰瓷给母亲筹集医药费，却遇到不按套路出牌的女司机，被撞后获得古医门传承，从此通医术、修功法、玩转都市，赢得无数美女青睐。',  5664,      '超爽黑啤 ',''),
(null,'都市之战神归来',         '../../static/img/man/man_b_08.jpg',   '../../static/img/man/man_b_08.jpg',      '377',  '为完成师父遗愿，特种神医唐朝回归都市成为女首富的未婚夫，开启无敌之路……别惹我，你惹不起！不管你富可敌国还是权倾天下，你的命，由我掌控！在这花花都市之中，纵意花海，一针生，一针死。不服者，吊打……',   '4093',      '路过地狱 ',''),
(null,'修罗天帝',               '../../static/img/man/man_b_09.jpg',   '../../static/img/man/man_b_09.jpg',      '263',   '八年前，雷霆古城一夜惊变，少城主秦命押入青云宗为仆，二十万民众赶进大青山为奴。八年后，淬灵入武，修罗觉醒，不屈少年逆天崛起。给我一柄刀，可破苍穹，给我一柄剑，可指霄汉。金麟岂是池中物，一遇风云便化龙。当修罗子、不死王、雷霆战尊、古海蛮皇等等一个个封号落在秦命身上，',  3329,      '实验小白鼠  ',''),
(null,'九阳神王',               '../../static/img/man/man_b_10.jpg',   '../../static/img/man/man_b_10.jpg',      '1653',  '落魄皇子秦云，得九阳传承，觉醒惊世武魂，习得绝世炼器之术。从此，他在修武大道上，一路潇洒风流。各种武道强者，为求他炼器，甘愿充当他当小弟。各色神女圣女，为求他炼器，都愿意委身与他。但秦云却不满意，天下美女十斗，他就要占十斗。',   3323,      '寂小贼  ','');


INSERT  INTO  book_user VALUES
(1,'admin','123321')
